{"organizations": [], "uuid": "87594f687c11d70f925c9504cf73a4e31340b47e", "thread": {"social": {"gplus": {"shares": 17}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 156, "shares": 156, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "mashable.com", "main_image": "http://i.amz.mshcdn.com/9qj085TdhqjleqFaU5h1Gm5yUaE=/1200x630/2017%2F03%2F04%2Fe6%2F2963c13a332747edbf14c083dc782d93.335d8.jpg", "site_section": "http://mashable.com/", "section_title": "Mashable", "url": "http://mashable.com/2017/03/04/ed-sheeran-divide-review/", "country": "US", "domain_rank": 360, "title": "'Divide' is a choose-your-own adventure Ed Sheeran experience", "performance_score": 1, "site": "mashable.com", "participants_count": 1, "title_full": "'Divide' is a choose-your-own adventure Ed Sheeran experience", "spam_score": 0.018, "site_type": "blogs", "published": "2017-03-04T23:52:00.000+02:00", "replies_count": 0, "uuid": "87594f687c11d70f925c9504cf73a4e31340b47e"}, "author": "Tricia Gilbride", "url": "http://mashable.com/2017/03/04/ed-sheeran-divide-review/", "ord_in_thread": 0, "title": "'Divide' is a choose-your-own adventure Ed Sheeran experience", "locations": [], "entities": {"persons": [{"name": "ed sheeran", "sentiment": "positive"}, {"name": "bieber", "sentiment": "none"}, {"name": "drake", "sentiment": "none"}, {"name": "taylor swift", "sentiment": "none"}, {"name": "lazer", "sentiment": "none"}, {"name": "calvin harris", "sentiment": "none"}, {"name": "sheeran", "sentiment": "none"}, {"name": "swift", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}, {"name": "spotify", "sentiment": "none"}, {"name": "tay", "sentiment": "none"}, {"name": "kylie", "sentiment": "none"}, {"name": "rihanna", "sentiment": "none"}], "locations": [{"name": "little big town", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Is Ed Sheeran the right person to be singing Ed Sheeran songs?\nThat’s something he’s trying to grapple with on ÷ (or Divide ), which takes a bolder divide and conquer approach to the British songwriter's well charted genre-hopping ways.\nThe point was clear from the get-go, when he kicked things off by simultaneously releasing two very different lead singles. \"Castle on the Hill\" is the soaring, Graceland -indebted song you'd expect from a twenty-something young man with an acoustic guitar and a gift for melody. But it's the song originally intended for Rihanna that immediately shattered a Spotify record previously held by Drake.\nSEE ALSO: Ed Sheeran would like to do a digital duet with you\n“'Shape Of You' was actually the only song that I was like this isn’t me at all,” Sheeran admitted in an interview with the streaming service.\nHe even took care to scrub details that could be construed as biographical, opting for a track that's amenable to shape-shifting. Eventually, his co-writers convinced him to put it on the album and make it a single.\nIt's easy to imagine the song's intended vessel having her way with it, or Bieber adding his own flourishes as he comes out of his sad boy Purpose phase. (Sheeran co-wrote the Bieber and Major Lazer collaboration \"Cold Water.\")\nBut the song made a splash precisely because Sheeran delivered it himself — not because he's a more capable performer, which he isn't — but because it's an outlier in his catalog.\nThe momentum of \"Shape of You\" set Sheeran up for his big post-\"Hotline Bling\" Drake moment. \"Shape of You\" is everywhere and will continue to be as you find yourself humming it without a hint of awareness.\nDrake has been Spotify's reigning king for what what feels like eternity in internet time and a deal with Apple Music couldn't slow down his bonkers streaming numbers. For Drake, it's partially a numbers game. Releasing a mixtape or two, collaborations, one-off singles and an album in the same years is a good way to keep streams coming. But it would be wrong to chalk it all up to all a \"throw everything against a wall and see what sticks\" strategy.\nDrake was a global superstar before \"Hotline Bling,\" but he quickly learned that swerving between genres had a huge payoff. \"One Dance\" and the wild card, stretched out Views followed shortly after and (thanks to new, streaming-friendly regulations) annihilated the charts. Drake got his biggest album with the album most fans feel the most neutral towards.\nOf course, Ed Sheeran raps, too, as he reminds you in the album's opening track, \"Eraser.\" Sheeran spits verses about the inconveniences of fame over a a folksy acoustic guitar: \"I think money is the root of all evil and fame is hell.\" Later, he makes a jab about \"keeping up with Kylie and Kim\" as if he's fundamentally different.\nThat's Sheeran's schtick, though, and whether or not you find him charming or grating — or which version of him you like — is probably something you've already decided.\nSheeran sets himself as his own worst enemy, which is a stretch. But sure, he paints a picture of a man who contains multitudes. He's a grieving grandson on \"Supermarket Flowers.\" He's the dude throwing back shots at the bar on, well, a lot of songs.\nAt times, it's glaringly obvious how Sheeran's privilege as a straight white dude has afforded him the ability to have a career where people can choose their own adventure on his album. Backwards-thinking, Queer Eye for the Straight Guy- era lines like, \"And wears a man bag on his shoulder, but I call it a purse,\" can be skipped, giving the moments Sheeran shines space to breathe.\nThe album is technically 12 tracks, but is there a soul alive that will listen to it that way? It's unlikely that most listeners will even realize that the 16 track version available online is comprised partially of bonus tracks.\n\"Sex With Me\" by Rihanna and \"New Romantics\" by Taylor Swift are bonus tracks on the singers' respective albums despite being better than plenty of music that made the cut, and it doesn't matter much. Swift even gave \"New Romantics\" a video — an honor not awarded to half of the album's actual tracks.\nSpeaking of Swift, Sheeran's learned from the best. His first brush with international fame came form his association with Tay and a duet on Red , which is a pretty good template for pop stars testing the waters of what they can be. Swift learned she could be a Pop Star beyond her country roots, and the blockbuster success of 1989 came together according to plan. Now she appears to be doing her own market research by zig zagging all over the music scene, ghostwriting for Rihanna, Calvin Harris, Little Big Town and possibly working with Drake without revealing her cards until a hit was a done deal.\nDivide , taken as a whole, feels like a resume. Like Swift and Drake, Sheeran's in a place right now where he's too big to really fail. It's everything Sheeran is and could possibly be. And for now, he can have his cake and eat it, too. So why not fill his pockets and jump off the plane knowing there's a parachute?", "external_links": ["https://news.spotify.com/us/2016/12/01/wrapped-2016/", "https://open.spotify.com/artist/6eUKZXaKkcviH0Ku9w2n3V"], "published": "2017-03-04T23:52:00.000+02:00", "crawled": "2017-03-04T18:02:26.865+02:00", "highlightTitle": ""}