{"organizations": [], "uuid": "fced4664e1ca6d28fc5eeaf55c12afef83bac32f", "thread": {"social": {"gplus": {"shares": 12}, "pinterest": {"shares": 2}, "vk": {"shares": 0}, "linkedin": {"shares": 31}, "facebook": {"likes": 248, "shares": 248, "comments": 1}, "stumbledupon": {"shares": 0}}, "site_full": "techcrunch.com", "main_image": "https://tctechcrunch2011.files.wordpress.com/2017/03/screen-shot-2017-02-28-at-10-35-31-pm.png?w=764&amp;h=400&amp;crop=1", "site_section": "http://feeds.feedburner.com/Techcrunch", "section_title": "TechCrunch", "url": "https://techcrunch.com/2017/03/01/in-liquid-biopsy-race-freenome-lands-65-million-led-by-andreessen-horowitz/", "country": "US", "domain_rank": 697, "title": "In liquid biopsy race, Freenome lands $65 million, led by Andreessen Horowitz", "performance_score": 2, "site": "techcrunch.com", "participants_count": 1, "title_full": "In liquid biopsy race, Freenome lands $65 million, led by Andreessen Horowitz", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-01T21:04:00.000+02:00", "replies_count": 0, "uuid": "fced4664e1ca6d28fc5eeaf55c12afef83bac32f"}, "author": "Connie Loizos", "url": "https://techcrunch.com/2017/03/01/in-liquid-biopsy-race-freenome-lands-65-million-led-by-andreessen-horowitz/", "ord_in_thread": 0, "title": "In liquid biopsy race, Freenome lands $65 million, led by Andreessen Horowitz", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In liquid biopsy race, Freenome lands $65 million, led by Andreessen Horowitz Posted Review: The Nintendo Switch \nFreenome , a two-year-old liquid biopsy diagnosis platform that detects the cell-free DNA sequencing of cancer, has raised a huge Series A round — $65 million — led by Andreessen Horowitz, which also led the company’s $5.5 million seed round less than a year ago. \nOther investors in the deal include GV, Polaris Partners, Innovation Endeavors, Spectrum 28, Asset Management Ventures, Charles River Ventures, AME Cloud Ventures, Allen and Company and earlier backers Data Collective and Founders Fund. \nThe amount of money involved speaks to the opportunity — as well as the competition — that Freenome is facing. A glut of liquid biopsy companies have emerged from universities and elsewhere in recent years to catch cancer by relying on a patient’s DNA, rather than having to extract their tissue. What these medical test companies haven’t been able to pinpoint exactly is where a cancer is growing, how serious a threat it is, and whether it will respond to treatment. \nThat’s not for lack of trying — or funding. \nGuardant Health, a four-year-old, Redwood Shores, Ca.-based company whose non-invasive genomic sequencing test for cancer requires just two vials of blood, has raised so far raised $190 million , including from OribMed Advisors, Khosla Ventures, and Sequoia Capital. \nGrail, a four-year-old, Venice, Ca.-based early cancer screening startup that spun out of the DNA-sequencing giant Illumina is reportedly looking to raise up to $1.7 billion in fresh funding to launch a large-scale clinical trial. ( In January of last year, it separately raised $100 million in Series A funding from Illumia, Microsoft cofounder Bill Gates, Amazon founder Jeff Bezos, and GV.) \nFreenome cofounder and CEO Gabe Otte told us last year that the “big differentiator here is that our technology allows us to answer [more questions than do competitors] because we’re looking at different biologies. . .We wanted to answer not just cancer or not cancer, but malignant or benign, and where the tissue is. So we capture all the [genetic material floating in our blood] rather than fixating on a few mutations known to be associated with cancer.” \nAt the time, Otte also said Freenome had validated its tests with hundreds of samples but it wasn’t ready to “blow $100 million” in venture capital on its platform before its technology is proven beyond a doubt. \nApparently, Freenome is feeling better about its odds today. Indeed, the 25-person company has now tested thousands of blood samples, and it says its tests outperform current screening tests on the market for four types of cancer: prostate, breast, colorectal, and lung. \nNow Freenome is using its massive round to expand into clinical trails, including with the help of 25 research partners that include the University of California San Diego and UCSF. The idea, says Otte, is to answer relevant questions about each cancer. For lung cancer, for example, it wants to be able to resolve whether a test shows non-small-cell lung carcinoma or small cell lung carcinoma. (The first is far less responsive to chemotherapy.) \nOtte says a machine learning component that “can create a screening test in software and learn from its mistake and and answer not just a single question but multiple questions,” should help. \nIn fact, if all goes well, suggests Otte, Freenome will have tested as many as 10,000 blood samples both in its own lab as well as via the various groups doing sequencing on its behalf within the next 12 months, and it can potentially move on to talks with the appropriate regulatory bodies for approval. \nAfter that, it’s into the doctor’s office — as long as it can get there first. 0", "external_links": [], "published": "2017-03-01T21:04:00.000+02:00", "crawled": "2017-03-01T16:14:21.218+02:00", "highlightTitle": ""}