{"organizations": [], "uuid": "01db2589b384ab98886183edca318cd2c1a0943d", "thread": {"social": {"gplus": {"shares": 32}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 8}, "facebook": {"likes": 468, "shares": 468, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.androidauthority.com", "main_image": "", "site_section": "http://www.androidauthority.com", "section_title": "Android Authority", "url": "http://www.androidauthority.com/youtube-tv-753915/", "country": "US", "domain_rank": 1848, "title": "Google’s YouTube TV is a streaming cable TV service for $35 a month", "performance_score": 4, "site": "androidauthority.com", "participants_count": 1, "title_full": "Google’s YouTube TV is a streaming cable TV service for $35 a month", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-01T05:40:00.000+02:00", "replies_count": 0, "uuid": "01db2589b384ab98886183edca318cd2c1a0943d"}, "author": "John Callaham", "url": "http://www.androidauthority.com/youtube-tv-753915/", "ord_in_thread": 0, "title": "Google’s YouTube TV is a streaming cable TV service for $35 a month", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\nGoogle is making another big move for its YouTube service. The company has announced its plans to launch YouTube TV in the US, an internet-based television service that will offer access to local broadcast networks like ABC, CBS, NBC, Fox and the CW, along with a bunch of cable networks, for $35 a month. The service will first launch later this year in the largest TV markets in the US, and will expand to more metro areas in the future.\nSee also: YouTube viewers check out over 1 billion hours of videos daily, but has it reached its peak? 3 hours ago In addition to the broadcast networks, YouTube TV will also offer access to over 40 cable channels. They will include entertainment channels like USA, FX, and SyFy, sports networks like ESPN and Fox Sports 1, and news channels like Fox News and MSNBC. The service will also offer access to the YouTube Originals shows that are available for subscribers to its YouTube Red service. YouTube TV will also offer access to the Showtime and Fox Soccer Plus premium channels for an additional fee.\nOne of the big features of the service its its cloud-based DVR.\nOne of the big features of the service its its cloud-based DVR. Google will offer an unlimited amount of cloud storage to save live TV shows, and YouTube TV will also support the recording of as many channels at the same time as you want. Each recording can be saved on the cloud account for up to nine months. The service will support up to six accounts for each paid subscription, and those folks can access up to three concurrent streams at a time. Each account can have its own personal cloud DVR storage, along with its own recommendations for TV shows.\nWhile this service sound promising, especially its cloud DVR feature, the truth is that YouTube TV will be launching in an already crowded market. Similar internet-based TV services like Sling TV , PlayStation Vue and more recently DirecTV Now , are already online, and Hulu plans to launch a similar service later this year as well. There certainly won’t be enough room for all of them to stay afloat. Also, the $35 a month price for YouTube TV may be a bit too high for some users, as Sling TV already offers 30 channels for just $20 a month. and over 40 channels at $25 a month.\nThere’s also the fact that, at least at the moment, YouTube TV seems to be lacking a bunch of the major cable networks in its service, including CNN, TNT, AMC, Comedy Central and premium channels like HBO. It remains to be seen if the service will be able to add those networks sometime in the future. Not being able to come to terms with the many. many TV networks was one of the big reasons why Apple reportedly decided to cancel its own plans to launch a internet TV service.\nGoogle plans to release a separate YouTube TV app for Android and iOS, and you will also be able to stream the video from those apps to your big screen TV with a Google Chromecast dongle or with a Chromecast built-in smart TV. There’s no word if a YouTube TV subscription will also include support for YouTube Red’s features like getting rid of ads or offline viewing of video.\nIf YouTube TV does launch in your market, would you consider paying for it and, as a result, make the move away from your standard cable or satellite service? Will this new service end up not offering enough channels and value for fans of TV? Do you think we will see one or more of these internet-based cable services shutting down because it can’t handle the competition and won’t be able to sign up enough people? Let us know your thoughts in the comments!", "external_links": [], "published": "2017-03-01T05:40:00.000+02:00", "crawled": "2017-03-01T01:08:36.238+02:00", "highlightTitle": ""}