{"organizations": [], "uuid": "cc77ca4ca5a7cd71a16ba1a0cbc025e606814e15", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 563, "shares": 563, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "motherboard.vice.com", "main_image": "https://video-images.vice.com/articles/58b98efb4814c8391402c7a9/lede/1488556766086-Amazonie_deforestation.jpeg?crop=1xw:0.7081310679611651xh;center,center&resize=1200:*", "site_section": "http://motherboard.vice.com/rss?trk_source=motherboard", "section_title": "motherboard", "url": "https://motherboard.vice.com/en_us/article/brazils-president-might-ramp-up-deforestation-in-the-amazon", "country": "US", "domain_rank": 173, "title": "The Brazilian Government Is Voting to Deforest Even More of the Amazon Rainforest", "performance_score": 5, "site": "vice.com", "participants_count": 1, "title_full": "The Brazilian Government Is Voting to Deforest Even More of the Amazon Rainforest", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-03T22:59:00.000+02:00", "replies_count": 0, "uuid": "cc77ca4ca5a7cd71a16ba1a0cbc025e606814e15"}, "author": "Grennan Milliken", "url": "https://motherboard.vice.com/en_us/article/brazils-president-might-ramp-up-deforestation-in-the-amazon", "ord_in_thread": 0, "title": "The Brazilian Government Is Voting to Deforest Even More of the Amazon Rainforest", "locations": [], "entities": {"persons": [{"name": "michel temer", "sentiment": "none"}, {"name": "eliseu padilha", "sentiment": "none"}, {"name": "charles clement", "sentiment": "none"}, {"name": "mazzetti", "sentiment": "none"}, {"name": "cristiane mazzetti", "sentiment": "none"}], "locations": [{"name": "sao paulo", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "amazonas state", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "amazon rainforest", "sentiment": "negative"}, {"name": "inpa", "sentiment": "none"}, {"name": "national institute for amazonian research", "sentiment": "none"}, {"name": "amazonas", "sentiment": "none"}, {"name": "skype", "sentiment": "none"}, {"name": "civil office", "sentiment": "none"}, {"name": "greenpeace amazon campaigner", "sentiment": "none"}, {"name": "amazonas state", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Brazilian Government Is Voting to Deforest Even More of the Amazon Rainforest This will take a toll on the trees that indigenous people have been coexisting with for centuries. \nWhen Spanish conquistadores first trundled upon the edges of the Amazon rainforest, they believed they were glimpsing a virgin landscape, untouched by man, apparently not paying much attention to the peoples that lived all along the river. It's a view that has persisted for centuries since, but it could not be further from the truth. \nAn expansive international study of Amazon tree species in the journal Science has revealed that trees domesticated—i.e. managed, used and maintained—by indigenous peoples have dominated large expanses of wilderness long before 1492. Unfortunately, the president of Brazil, Michel Temer, and the minister of Civil Office, Eliseu Padilha, are considering a proposal to end protection of around one million hectares of wilderness in the Amazon rainforest, potentially putting many numbers of these tree species, and the people who rely on them, at risk. \nFrom 2012 to 2015, deforestation in Brazil ratcheted up by 75 percent. The protected parcels that the current President wants to open up, known as Conservation Areas , are located in Amazonas State. \n\"Amazonas state has the largest contiguous portion of forest in the Amazon,\" Cristiane Mazzetti, a Greenpeace Amazon Campaigner in Sao Paulo told Motherboard over Skype. The Conservation Areas in question, she said, \"are so important as barriers there, because they're stopping the expansion from the south,\" of land grabbers and illegal activity. \nThe forest also serves as protection. Many of the 85 domesticated tree species the international team of ecologists surveyed, like cacao, acai, and brazil nut, are still of vital importance for the livelihoods of Amazonian peoples. After analyzing 1000 different tree surveys from across the Amazon basin, the team found that these domesticated trees were five times more common than their non-domesticated counterparts. \n\"This lays to rest the long-standing myth of the 'empty Amazon',\" said ecologist and coauthor of the study Charles Clement of Brazil's National Institute for Amazonian Research ( INPA ), in a public statement. \"This study confirms that even areas of the Amazon that look empty today are crowded with ancient footprints.\" \nEven so, it stands to lose those footprints at the hands of industrialization and greed. Amazonas State alone suffered from a 54 percent increase in deforestation in 2016. \"Deforestation is increasing again, and instead of taking actions for combating it, the government is giving an incentive for more,\" said Mazzetti. \nThe revelation that ancient domesticated tree species still vital to many Amazonian peoples' livelihoods are widespread throughout the rainforest highlights another layer of irresponsibility and shortsightedness in the wanton destruction of the Amazon.", "external_links": [], "published": "2017-03-03T22:59:00.000+02:00", "crawled": "2017-03-04T04:30:09.199+02:00", "highlightTitle": ""}