{"organizations": [], "uuid": "87cd28d0490ee2e2c91aea03d92e5aa236031e51", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 844, "shares": 844, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxsports.com", "main_image": "http://b.fssta.com/uploads/2017/03/usatsi_9904896.vresize.1200.630.high.0.jpg", "site_section": "http://api.foxsports.com/v1/rss?partnerKey=zBaFxRyGKCfxBagJG9b8pqLyndmvo7UU", "section_title": "FOX Sports Digital", "url": "http://www.foxsports.com/nba/gallery/warriors-lost-kevin-durant-injury-wizards-030117", "country": "US", "domain_rank": 1307, "title": "The Warriors lost Kevin Durant ... and are still the class of the NBA", "performance_score": 8, "site": "foxsports.com", "participants_count": 0, "title_full": "The Warriors lost Kevin Durant ... and are still the class of the NBA", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-01T20:07:00.000+02:00", "replies_count": 0, "uuid": "87cd28d0490ee2e2c91aea03d92e5aa236031e51"}, "author": "", "url": "http://www.foxsports.com/nba/gallery/warriors-lost-kevin-durant-injury-wizards-030117", "ord_in_thread": 0, "title": "The Warriors lost Kevin Durant ... and are still the class of the NBA", "locations": [], "entities": {"persons": [{"name": "kevin durant", "sentiment": "negative"}, {"name": "klay thompson", "sentiment": "none"}, {"name": "geoff burke geoff burke-usa", "sentiment": "none"}, {"name": "barnes", "sentiment": "none"}, {"name": "livingston", "sentiment": "none"}, {"name": "matt barnes", "sentiment": "none"}, {"name": "stephen curry", "sentiment": "none"}, {"name": "iguodala", "sentiment": "none"}, {"name": "troy wayrynen troy wayrynen-usa", "sentiment": "none"}, {"name": "steve kerr", "sentiment": "none"}, {"name": "andrew bogut", "sentiment": "none"}, {"name": "bill streicher bill streicher-usa", "sentiment": "none"}, {"name": "james harden", "sentiment": "none"}, {"name": "shaun livingston", "sentiment": "none"}, {"name": "durant", "sentiment": "none"}, {"name": "curry", "sentiment": "none"}, {"name": "lebron james", "sentiment": "none"}, {"name": "andre iguodala", "sentiment": "none"}, {"name": "russell westbrook", "sentiment": "none"}], "locations": [{"name": "west", "sentiment": "none"}, {"name": "draymond green", "sentiment": "none"}], "organizations": [{"name": "nba", "sentiment": "negative"}, {"name": "warriors", "sentiment": "negative"}, {"name": "wizards", "sentiment": "none"}, {"name": "okc", "sentiment": "none"}, {"name": "cavaliers", "sentiment": "none"}, {"name": "rockets", "sentiment": "none"}, {"name": "spurs", "sentiment": "none"}, {"name": "mvp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Mar 1, 2017 at 8:06a ET 0Shares \nThe Warriors lost Kevin Durant on Tuesday night, as the All-Star forward and former league MVP suffered a hyperextended knee in the Dubs’ 112-108 loss to the Wizards. The team has added Matt Barnes to the roster in the meantime. \nThe injury capped off a shaky week for the Warriors and the team’s fans. Stephen Curry had a historically bad shooting night this week, going 0-11 from deep, the Cavaliers added former Dubs center Andrew Bogut to the roster for their late-season run, the loss to the Wizards and then the loss of Durant. Bill Streicher Bill Streicher-USA TODAY Sports \nIt was all a lot to take in. Was this the same team? Had the power shifted elsewhere? The Spurs, Rockets and Clippers were still lingering in the West, and that isn’t even thinking about the juggernaut that LeBron James and the Cavaliers are putting together. \nThis is all nonsense, however. Durant or not, the Warriors are as good as anyone in the league. Geoff Burke Geoff Burke-USA TODAY Sports \nMost NBA teams aren’t equipped to lose a star player, especially a top-5 player like Kevin Durant. Take Russell Westbrook off the Thunder this year, for example, and OKC immediately becomes a lottery team. The Rockets without James Harden would struggle to make the playoffs. \nThe Warriors without Kevin Durant are, well, they’re still the Warriors. They still have two of the greatest shooters to ever play the game in Stephen Curry and Klay Thompson. They have one of the most unique and gifted big men in the league in Draymond Green. They still have the veteran bench presence of Andre Iguodala and Shaun Livingston, and one of the best few coaches in the league in Steve Kerr. Troy Wayrynen Troy Wayrynen-USA TODAY Sports \nThis is the essential core of the team that won a title and then won 73 games last year. They’ll have to make some tweaks to bring back the offense to a more Curry and Thompson-centric one. Green may need to take a few more shots. Iguodala and Livingston will probably pick up a few more minutes in Durant’s absence. \nBut does anyone really doubt that this team can still win? Geoff Burke Geoff Burke-USA TODAY Sports \nThe Warriors' four most-used and four most devastating lineups this season have all featured Durant, yes. But a five of Curry-Thompson-Iguodala-Draymond-Pachulia is still a nightmare for opponents, and has been quietly effective all season when the Warriors have gone to it. (The lineup is +41 in points and has a +.275 eFG% over opponents, a higher number than any lineup with Durant, per Basketball Reference .) \nIf that’s the Warriors crunch-time five, with Barnes adding some grit in Durant’s absence, and Livingston/Iguodala taking a few more shots per game, they can still beat anyone. Seriously. Give me the Durant-less Warriors in a seven-game series with the Cavaliers … I’m picking the Cavaliers, sure, but that’s not a sweep. That’s a really interesting series. Geoff Burke Geoff Burke-USA TODAY Sports \nWhile it’s unknown how much time Durant will miss, it doesn’t look as of now that he’ll miss the playoffs. If he’s there at the end, the Warriors can still win a title. I think they might be able to do it even without him. Bill Streicher Bill Streicher-USA TODAY Sports", "external_links": [], "published": "2017-03-01T20:07:00.000+02:00", "crawled": "2017-03-01T15:23:35.949+02:00", "highlightTitle": ""}