{"organizations": [], "uuid": "d7342f649a6b9b23b927b9f5cecac932dc9d7d03", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 147, "shares": 147, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sherdog.com", "main_image": "http://www1.cdn.sherdog.com/_images/headers/20170303082546_09_1DX_9426.JPG", "site_section": "http://fightline.com/feed/", "section_title": "Fightline.com", "url": "http://www.sherdog.com/news/news/Julia-Budd-Overwhelms-Marloes-Coenen-to-Claim-Inaugural-Bellator-Womens-Featherweight-Title-118155", "country": "US", "domain_rank": 5787, "title": "Julia Budd Overwhelms Marloes Coenen to Claim Inaugural Bellator Women’s Featherweight Title", "performance_score": 1, "site": "sherdog.com", "participants_count": 1, "title_full": "Julia Budd Overwhelms Marloes Coenen to Claim Inaugural Bellator Women’s Featherweight Title", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-04T11:28:00.000+02:00", "replies_count": 0, "uuid": "d7342f649a6b9b23b927b9f5cecac932dc9d7d03"}, "author": "fightline", "url": "http://www.sherdog.com/news/news/Julia-Budd-Overwhelms-Marloes-Coenen-to-Claim-Inaugural-Bellator-Womens-Featherweight-Title-118155", "ord_in_thread": 0, "title": "Julia Budd Overwhelms Marloes Coenen to Claim Inaugural Bellator Women’s Featherweight Title", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Brian Knapp Mar 3, 2017 A fledgling division now finds itself looking up at Julia Budd . The Canadian muay Thai practitioner overpowered Marloes Coenen to a fourth-round finish, as she laid claim to the inaugural Bellator MMA women’s featherweight championship in the Bellator 174 headliner on Friday at the Winstar World Casino in Thackerville, Oklahoma. Budd (10-2, 4-0 Bellator) drew the curtain with punches 2:42 into Round 4, having extended her winning streak to eight straight fights. Very little went right for Coenen (23-8, 2-2 Bellator). Budd struck for takedowns in all four rounds, threaded her ground-and-pound through the Dutchwoman’s spidery guard and consolidated all of it with suffocating top control. She dragged Coenen to the canvas inside the first minute of Round 4, achieved full mount and let loose with a sustained volley of punches and elbows until referee John McCarthy had seen enough. Afterward, the 35-year-old Coenen announced her retirement from mixed martial arts. In the co-main event, Team Quest export Fernando Gonzalez won for the sixth time in seven appearances, as he captured a unanimous decision from Brandon Girtz at a 175-pound catchweight. All three cageside judges gave the nod to Gonzalez (26-14, 6-1 Bellator): 29-28, 29-27 and 30-26. A natural lightweight, Girtz (14-6, 6-4 Bellator) did what he could to compensate for a significant size and power disadvantage. The 31-year-old Grudge Training Center rep delivered multiple takedowns, but his inability to corral Gonzalez on the mat proved problematic and costly. The World Extreme Cagefighting veteran answered Girtz’s efforts with thudding punches and steady pressure; and by the time the third round arrived, Gonzalez had taken control. There, he had Girtz reeling more than once with clean left hands upstairs, forcing him into an almost constant backpedal. The judges took notice. Girtz, 31, has lost back-to-back bouts. Meanwhile, “The Ultimate Fighter 10” alum Justin Wren submitted Roman Pizzolato with a first-round arm-triangle choke in their heavyweight showcase. Pizzolato (9-6, 0-1 Bellator) conceded defeat 2:35 into Round 1, his modest two-fight winning streak having run its course. Wren (13-2, 3-0 Bellator) made it look easy. He executed a lateral drop inside the first 20 seconds and later scored with a belly-to-back suplex. Wren then softened Pizzolato with punches, climbed to full mount and hammered away with elbows on his pink-haired counterpart before cinching the choke, passing to the side and squeezing for the tapout. “The Big Pygmy” has rattled off six consecutive victories. Elsewhere, four-time Brazilian jiu-jitsu world champion Rafael Lovato Jr. wowed the crowd in his organizational debut, as he dispatched Charles Hackmann in the first round of their catchweight encounter at 195 pounds. Lovato (5-0, 1-0 Bellator) brought it to a close 13 seconds into Round 1, authoring the sixth-fastest finish in Bellator history. Hackmann (4-5, 0-1 Bellator) was cooked before he realized what happened. Lovato stunned him with a head kick, backed it up with a pair of knee strikes and sealed the deal with a burst of punches along the fence, as referee Jason Herzog called for the standing TKO. In other action, Emmanuel Rivera (6-0) picked up a unanimous decision over Treston Thomison (10-5) in their three-round confrontation at a 150-pound catchweight, earning 30-26, 30-27 and 30-27 marks on the scorecards; Cody Pfister (13-6-1) submitted Jonathan Gary (12-8-2) with a rear-naked choke 4:04 into the first round of their lightweight affair; Emily Ducote (5-2) tapped Katy Collins (6-2) with a rear-naked choke 4:53 into the first round of their battle at 125 pounds; Gabrielle Holloway (6-5) took care of Alexis Dufresne (6-3) with punches 2:53 into the second round of their featherweight tilt; and Justin Patterson (9-1) wiped out Jason Witt (7-4) with punches 13 seconds into the first round of their catchweight pairing at 175 pounds.", "external_links": [], "published": "2017-03-04T11:28:00.000+02:00", "crawled": "2017-03-04T09:03:16.023+02:00", "highlightTitle": ""}