{"organizations": [], "uuid": "d75a62cce63e6975a18a42c2e834a77619009371", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 118, "shares": 118, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "deadspin.com", "main_image": "https://i.kinja-img.com/gawker-media/image/upload/s--d2ds-94R--/c_fill,fl_progressive,g_center,h_450,q_80,w_800/sleqfuofdh8gc3xsrejn.jpg", "site_section": "http://screamer.deadspin.com/rss", "section_title": "Deadspin", "url": "http://deadspin.com/bill-polian-says-some-shit-about-terrell-owens-and-rand-1792827150", "country": "ID", "domain_rank": 1077, "title": "Bill Polian Says Some Shit About Terrell Owens And Randy Moss", "performance_score": 1, "site": "deadspin.com", "participants_count": 1, "title_full": "Bill Polian Says Some Shit About Terrell Owens And Randy Moss", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-01T04:11:00.000+02:00", "replies_count": 0, "uuid": "d75a62cce63e6975a18a42c2e834a77619009371"}, "author": "Samer Kalaf", "url": "http://deadspin.com/bill-polian-says-some-shit-about-terrell-owens-and-rand-1792827150", "ord_in_thread": 0, "title": "Bill Polian Says Some Shit About Terrell Owens And Randy Moss", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Go to permalink Photo: Darron Cummings/ AP \nFormer Indianapolis Colts executive Bill Polian opened up a can of takes that expired in 2007 to answer a question about whether he’d vote for Terrell Owens and Randy Moss for the Pro Football Hall Of Fame. (Owens has been eligible for the Hall for two years now but hasn’t yet been voted in; Moss will be eligible in 2018.) From Talk Of Fame Network : Advertisement \n“I take neither,” he said. “First of all, here’s my position: (I want players who) contribute both individually and to the team. T.O.’s situation, T.O.’s temperament, his ability to contribute to the team was well known up front. He was going to be a problem. We did not want to deal with problem children. Others may. We didn’t. \n“That’s number one. Number two, every year in Indianapolis we said the following: ‘The price of admission is 100 percent effort all the time in everything we do.’ Well, how can we take Randy Moss when we make that statement? It’s that simple.” \nOwens seems like he’d have been worth the headache because he was one of the best receivers of his and all time, but not to Polian, although he admits that Owens and Moss will probably get in anyway: Advertisement \n“I think they will, unfortunately in my view,” said Polian, “because whether you like it or not. these ‘electoral campaigns’ have a way of swinging people. In my view, and I said this publicly last year, I think the Hall of Fames are for people who make their teams better, not who detract from them. \n“Now, T.O. was a bigger detractor over his career than Moss, but you certainly wouldn’t call (Moss’ attitude) any harbinger or example of what you want in a football player other than when he decided to play. ‘I play when I play.’ I don’t buy it.” \nIn today’s NFL, you’ll get the occasional analyst griping about a receiver (usually Dez Bryant) now and then, but the league is mostly past the golden age of complaining about well-paid loudmouth receivers. Polian’s comments really bring it back. \nOwens and Moss, who are respectively second (15,934) and third (15,292) in all-time receiving yards behind Jerry Rice, humiliated countless defensive backs, infuriated numerous opponents, and set records, but they left potential production on the table. Because of that, Polian doesn’t think they gave everything to the team. Did Owens, who played on a broken leg in Super Bowl XXXIX and caught nine passes for 122 yards, make the Eagles better? According to Polian, no. Was Moss, who holds the record for most receiving touchdowns in one season with 23, beneficial to Tom Brady and the 2007 Patriots? Maybe Polian thinks Jabar Gaffney could have made those receptions. Sponsored \nPolian will stick with Hall Of Fame wideout Marvin Harrison, who happens to have been one of his guys from Polian’s time as the Colts’ GM. He lobbied hard for Harrison’s induction after Harrison missed the 2014 class: \n“In Marvin’s case,’’ Polian said, “if he doesn’t make it next year there ought to be a Congressional investigations. He belongs in there. \n“I just can’t get my head around (Harrison not making it). Marvin has to be in there.’’ \nOf course, Marvin Harrison’s temperament was nothing like T.O.’s. Advertisement", "external_links": [], "published": "2017-03-01T04:11:00.000+02:00", "crawled": "2017-03-01T00:16:08.988+02:00", "highlightTitle": ""}