{"organizations": [], "uuid": "b518c50bbc3229d2cd8c279225773127cb4c0ced", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 223, "shares": 223, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.runnersworld.com", "main_image": "http://www.runnersworld.com/sites/runnersworld.com/files/articles/2017/03/bgb-aubin.jpg", "site_section": "http://www.runnersworld.com/rss.xml", "section_title": "Runner's World", "url": "http://www.runnersworld.com/the-big-guy-blog/4-lessons-you-can-learn-from-these-race-prs", "country": "US", "domain_rank": 4315, "title": "4 Lessons You Can Learn From These Race PRs", "performance_score": 2, "site": "runnersworld.com", "participants_count": 1, "title_full": "4 Lessons You Can Learn From These Race PRs", "spam_score": 0.0, "site_type": "blogs", "published": "2017-03-03T20:31:00.000+02:00", "replies_count": 0, "uuid": "b518c50bbc3229d2cd8c279225773127cb4c0ced"}, "author": "tedspiker", "url": "http://www.runnersworld.com/the-big-guy-blog/4-lessons-you-can-learn-from-these-race-prs", "ord_in_thread": 0, "title": "4 Lessons You Can Learn From These Race PRs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "4 Lessons You Can Learn From These Race PRs There’s nothing quite like watching your friends obliterate their goals. By Ted Spiker Friday, March 3, 2017, 11:02 am Therese Schweyer, left, and Andy Aubin of the Sub-30 Club after the Gasparilla Half Marathon (and crushing their PRs). Photograph courtesy of Andy Aubin \nWe all know that the runner’s high can come in many forms. \nThere’s the one that kicks in on the final stretch. There’s the one that lasts for days after a triumphant trot. There’s the one that negates the guilt of a monstrous slice of sausage pizza. Advertisement \nQuote of the Day, motivation, and inspiration — every morning rundown \nAdvice on training, nutrition, shoes, and more — every evening Keep this field blank \nPrivacy Policy | About Us \nLast weekend, my high came from the fumes I felt from the badass races of my pals. \nWhile I happily slopped through my own race — and even more happily got to hang with a few dozen members of my Sub-30 Club tribe — I loved seeing so many of my favorite people have monumental barrier-busting races. Some of their milestones and the lessons I’ll take from them: Sub-4 Marathon (and 4-Second PR) \nMy friend, Tom Kelleher, has been religiously hitting his training runs and was looking to go sub-4—something he hadn’t done in five years. He ran the 2017 5 Points of Life Marathon in Gainesville, Florida. \nPrevious PR: 3:59:31 \nNew PR: 3:59:27 \nKey: “In a way, the training is the goal, because otherwise I would never get that much exercise in a normal week.” \nTraining trick: “Putting scheduled runs in my to-do list. Making long runs mini ‘ destination races ’ for sightseeing when traveling.” \nTurning point on race day: “When the 4-hour pacer caught me at mile 24, then running like he was the Grim Reaper just to pick up 33 seconds by the finish line.” Sub-2 Half Marathons (After Running a 20K the Day Before) \nAndy Aubin, executive director of the Sub-30 Club, and Therese Schweyer, assistant executive director, have been aggressively training to go sub-2. But not until recently did they make that goal public. They ran together at the Gasparilla Half Marathon in Tampa, Florida—the day after running the 15K and 5K. \nAndy’s p revious PR: 2:17:12 \nNew PR: 1:58:33 \nKey: “I built a multilayer support system. At the core was my training partner, Therese, who was working the same training plan at the same time that I was. We also had a four-person daily chat. This was huge in terms of support and an area to vent. I got loud and broadcast my goals to our entire 5,000+ member running club. This provided a massive wave of support and positivity (and public accountability) for me.” \nTraining trick: “I utilized a structured training plan with prescribed paces and specific race workouts (tempo runs, track/speedwork, recovery runs, and long runs incorporating race pace miles).” \nTurning point on race day: “I ran a smart race on race day by starting slow and building momentum as he race wore on. It took until the final mile, but passing the 2:00 pace group was the real indicator that it was going to happen.”", "external_links": [], "published": "2017-03-03T20:31:00.000+02:00", "crawled": "2017-03-04T03:38:25.894+02:00", "highlightTitle": ""}